{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Задача 1\n",
    "Напишите программу, которая:\n",
    "1. Считывает числа из консоли\n",
    "2. После каждого считывания добавляет число в список lst\n",
    "3. Суммирует все числа в списке\n",
    "4. Если сумма больше 300 прекращает работу и выводит на экран сообщение \"сумма = \", \"количество элементов в списке = \""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "введите число: 3\n",
      "введите число: 4\n",
      "введите число: 5\n",
      "введите число: 10\n",
      "введите число: 500\n",
      "сумма = 522 , количество элементов в списке = 5\n"
     ]
    }
   ],
   "source": [
    "lst = []\n",
    "while sum(lst) <= 300:\n",
    "    x = int(input('введите число: '))\n",
    "    lst = lst + [x]\n",
    "print ('сумма =',sum(lst), ', количество элементов в списке =',len(lst))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Задача 2\n",
    "\n",
    "**Не используя** стандартные функции min() и max() реализовать:\n",
    "\n",
    "1. Завести список (размером не менее 10 элементов), заполнить его числами.\n",
    "2. Используя цикл for и if-else реализовать поиск минимального и максимального чисел в списке. \n",
    "3. Вывести минимальное и максимальное числа на экран\n",
    "\n",
    "Учесть, что числа могут быть отрицательными, повторяющимися"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Задача 3\n",
    "\n",
    "1. Завести матрицу (2-мерный список) размером 3х4\n",
    "2. Преобразовать её к np.array.\n",
    "3. Найти сумму значений каждого **стобца** матрицы, вывести на экран, записать эти значения в отдельный список\n",
    "4. Используя функции `np.min` и `np.max` найти минимальную и максимальную из сумм. Вывести на экран"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.6.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
